Revit 2027 API
DirectShape.AreOptionsValidForTransientDirectShape Method
 Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreOptionsValidForTransientDirectShape(
	DirectShapeOptions options
)
Public Function AreOptionsValidForTransientDirectShape (
	options As DirectShapeOptions
) As Boolean
public:
bool AreOptionsValidForTransientDirectShape(
	DirectShapeOptions^ options
)
member AreOptionsValidForTransientDirectShape :
        options : DirectShapeOptions -> bool
Parameters
options DirectShapeOptions
 The options object.
Return Value
Boolean
 True if the DirectShapeOptions are valid; false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace